README.md
```mermaid
erDiagram
    USER {
        String id PK
        String email
        String name
        String address
        String password
        DateTime createdAt
        Boolean visible
    }
    PERMISSION {
        String id PK
        String name
        String description
        DateTime createdAt
        Boolean visible
    }
    ROLE {
        String id PK
        String name
        String description
        DateTime createdAt
        Boolean visible
    }
    AUTHOR {
        String id PK
        String name
        String biography
        DateTime createdAt
        Boolean visible
    }
    PUBLISHER {
        String id PK
        String name
        String address
        DateTime createdAt
        Boolean visible
    }
    CATEGORY {
        String id PK
        String name
        String description
        DateTime createdAt
        Boolean visible
    }
    EMPLOYEE {
        String id PK
        String name
        String cpf
        String telephone
        String address
        DateTime createdAt
        Boolean visible
    }
    BOOK {
        String id PK
        String title
        String description
        String isbn
        Int year
        String publisherId FK
        String loanTypeId FK
        DateTime createdAt
        Boolean visible
    }
    LOAN {
        String id PK
        DateTime loanDate
        DateTime dueDate
        DateTime returnDate
        Float fees
        Boolean returned
        String condition
        String paymethod
        String userId FK
        String bookId FK
        String employeeId FK
        DateTime createdAt
        Boolean visible
    }
    LOANTYPE {
        String id PK
        String name
        Float fine
        Int day
        String description
        DateTime createdAt
        Boolean visible
    }
    USER ||--o{ LOAN : "has"
    USER }|..|{ PERMISSION : "has"
    USER }|..|{ ROLE : "has"
    BOOK }o--|| PUBLISHER : "published by"
    BOOK }o--|| LOANTYPE : "has"
    BOOK }o--|{ AUTHOR : "written by"
    BOOK }o--|{ CATEGORY : "categorized as"
    LOAN }|--|| USER : "borrowed by"
    LOAN }|--|| BOOK : "includes"
    LOAN }|--|| EMPLOYEE : "handled by"
    PERMISSION }|..|{ ROLE : "granted by"
    ROLE }|..|{ USER : "assigned to"
```
